fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Договоры</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда
		Объект.ВКМ_Период = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;

	ВКМ_ЗаполнитьТаблицуДоговоровНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_Заполнить(Команда)

	ВКМ_ЗаполнитьТаблицуДоговоровНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВКМ_СоздатьАкты(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите период (месяц).'"));
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = ВКМ_ЗапуститьСозданиеАктовНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ВКМ_ПослеЗавершенияСозданияАктов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ЗаполнитьТаблицуДоговоровНаСервере()
    ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаДоговоров = ТекущийОбъект.ВКМ_ЗаполнитьСписокДоговоров(Объект.ВКМ_Период);
	Объект.ВКМ_Договоры.Очистить();
	Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		НоваяСтрока = Объект.ВКМ_Договоры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоговора);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВКМ_ЗапуститьСозданиеАктовНаСервере()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов по абонентским договорам'");

	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ВКМ_МассовоеСозданиеАктов.ВКМ_СоздатьРеализацииЗаМесяц",
		Объект.ВКМ_Период);

КонецФункции

&НаКлиенте
Процедура ВКМ_ПослеЗавершенияСозданияАктов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;

	ВКМ_ОбработатьРезультатСозданияНаСервере(Результат.АдресРезультата);
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Массовое создание актов завершено.'"));

КонецПроцедуры

&НаСервере
Процедура ВКМ_ОбработатьРезультатСозданияНаСервере(АдресРезультата)

	ДанныеРезультата = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(ДанныеРезультата) <> Тип("Структура") Тогда
		ВКМ_ЗаполнитьТаблицуДоговоровНаСервере();
		Возврат;
	КонецЕсли;

	Объект.ВКМ_Договоры.Очистить();
	Если ДанныеРезультата.Свойство("Строки") Тогда
		Для Каждого ОписаниеСтроки Из ДанныеРезультата.Строки Цикл
			НоваяСтрока = Объект.ВКМ_Договоры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСтроки);
		КонецЦикла;
	КонецЕсли;

	Если ДанныеРезультата.Свойство("Ошибки") Тогда
		Для Каждого ТекстОшибки Из ДанныеРезультата.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
